In [1]:
import pandas as pd
import numpy as np

 

df_dict = {'CUSTID': ['98981', '897892','32323','98900','98981'],
           'CamapignID': ['C1', 'C2','C3','C1', 'C1'],
           'Units Puchased':[2,1,7,4,2]}
campaign_df = pd.DataFrame(data=df_dict)
campaign_df

 

# Calculate the total Units purchased per campaign
select CamapignID,sum(Units Puchased) as sum from customer group by CamapignID

# Calculate the total Units purchased , excluding those Units sold from campaign 2 (C2)

# return / find the custid with the highest units purcahsed across all campaigns aggregations not required.



select duplicated(*) from customer

   CUSTID CamapignID  Units Puchased
0   98981         C1               2
1  897892         C2               1
2   32323         C3               7
3   98900         C1               4
4   98981         C1               2

In [2]:
campaign_df.groupby(['CamapignID']).sum()

            Units Puchased
CamapignID
C1                       8
C2                       1
C3                       7

In [9]:
campaign_df[campaign_df['CamapignID'] != "C2"].groupby(['CamapignID']).sum()

            Units Puchased
CamapignID
C1                       8
C3                       7